#include <stdio.h>

/*int main () {
   printf("%s%72s","Computer","Programing");
   return(0);
}*/
int main()
{
  printf("123456789012345678901234567890\n");
  printf("%30f\n",3.1415926535897932); //จอง 30 ช่องชิดขวา
  printf("%-30f\n",3.1415926535897932); //จอง 30 ช่องชิดซ้าย
  printf("%20f\n",3.1415926535897932); //จอง 20 ช่องชิดขวา
  printf("%.20f\n",3.1415926535897932); //แสดงผลทศนิยม 20 ตำแหน่ง
  printf("%30.20f\n",3.1415926535897932); //จอง 30 ช่อง ทศนิยม 20 ตำแหน่ง ชิดขวา
  
  return 0;
}

